console.log("hi link ! ")


//chap5)

// ** 스코프?
// 스코프는 범위라고 생각하면 된다.
// 1. 전역 스코프 2. 지역 스코프 3. 블록 스코프

// 변수 이름 규칙(=식별자 규칙)
// 식별자 : 이름을 붙일 떄 사용하는 단어 (변수명, 함수명, 클래스 명,...)
// - 키워드(예약어) 사용 불가능 
// 키워드란 ? 특별한 역할을 이미 하고 있는 단어. (이미 예약되어 있는 곳을 사용 못하는 것과 같음.)
// ex) let,var,const, void ... 
// 숫자로 시작하는 것 X
// 특수 문자 : _ $만 사용 
// 공백 문자 (space bar) X
// 식별자에 단어 두개 이상 작성하고 싶은 경우?
// - camelCase 사용 :redApple, isWater
// - snake_case 사용 : red_apple,is_water

// 상수란 ? 프로그램이 실행되는 동안 값이 변하지 않는 데이터 
// 한번 정의되면 프로그램 실행중에는 변경되지 않아야 한다.(고정값)
// 보통 대문자로 표기함. (개발자 커뮤 국룰)  ex) TOMATO , APPLE 

